Repository: 84000/data-translation-memory
Catalog: toh186-v2.tmx
Source language: bo
Languages: en

source: བདེ་འགྲོར་འགྲོ་བར་འགྱུར་བ་དང་།
en: They will pass to pleasant forms of existence.

source: ལག་ན་རྡོ་རྗེས་ཡོངས་སུ་བཟུང་བར་འགྱུར་བ་དང་།
en: They will be accepted by Vajrapāṇi.

source: ཇི་ལྟར་འདོད་པའི་གནས་སུ་སྐྱེ་ཞིང་ཚེ་རབས་དྲན་པར་འགྱུར་བ་སྟེ།
en: They will be born wherever they might wish and will remember the succession of their former lives.

source: ཡོན་ཏན་ཆེན་པོ་དེ་བརྒྱད་ཐོབ་པར་འགྱུར་རོ། །
en: In this way those sons or daughters of noble family, and the others, will attain the eight great qualities.

source: དེས་ནི་དེ་བཞིན་གཤེགས་པ་འདི་དག་ལ་དེ་བཞིན་གཤེགས་པའི་ལྷའི་མཆོད་པ་དང་། མངོན་སུམ་དུ་མཆོད་པས་ལོ་འབུམ་གྱི་བར་དུ་མཆོད་པར་འགྱུར་རོ། །
en: Thus, for one hundred thousand years they will venerate these tathāgatas with the divine and manifest offerings meant for a tathāgata.

source: གང་ཡང་འཛམ་བུའི་གླིང་འདི་དེ་བཞིན་གཤེགས་པའི་རིང་བསྲེལ་གྱི་མཆོད་རྟེན་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་པས་གང་བར་བྱས་ཏེ།
en: “Suppose someone were to fill Jambudvīpa with tathāgatas’ relic stūpas made of the seven precious substances, and then

source: ལྷའི་ཕྲེང་བ་དང་། བྱུག་པ་དང་། མེ་ཏོག་དང་། མར་མེ་དང་། རིན་པོ་ཆེའི་གདུགས་དང་། སིལ་སྙན་དང་། རྒྱལ་མཚན་དང་། བ་དན་རྣམས་ཀྱིས་ལོ་འབུམ་དུ་བཀུར་སྟི་བྱས་ཏེ་
en: venerate, revere, and worship them for one hundred thousand years with divine garlands, salves, flowers, lamps, precious umbrellas, cymbals, royal banners, and flags—

source: རྗེད་ཅིང་མཆོད་པ་བས་གང་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཆང་བ་དང་། ཀློག་པ་དང་། མཆོད་པ་དང་། འདྲི་བ་དང་། འདྲིར་འཇུག་པ་དང་། གཞན་དག་ལ་ཡང་དག་པར་རབ་ཏུ་བསྟན་ན་
en: [compared to such a person,] someone who keeps in mind the various teachings of the Dharma with faith in the Tathāgata and who reads them, worships them, copies them or commissions their copying, and teaches them correctly to others [will have a vastly greater increase in merit].

source: དེ་བས་འདི་ཆེས་བསོད་ནམས་མང་དུ་འཕེལ་ལོ། །
en: compared to such a person, [someone who keeps in mind the various teachings of the Dharma with faith in the Tathāgata and who reads them, worships them, copies them or commissions their copying, and teaches them correctly to others] will have a vastly greater increase in merit.

source: རིགས་ཀྱི་བུ་གང་ལ་ལ་ཞིག་གིས་འཛམ་བུའི་གླིང་གི་སེམས་ཅན་དེ་དག་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་གཞོག་ཅིང་། བཞག་ནས་ཀྱང་
en: Son of noble family, suppose someone were to set the beings of Jambudvīpa on the noble eightfold path and, after having done so,

source: ལྷའི་ལོ་སྟོང་དུ་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་མི་བྲེལ་བར་རྗེད་ཅིང་མཆོད་པ་བས།
en: venerated and worshipped the Tathāgata for a hundred thousand divine years with all the necessities of life there might be—

source: གང་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལས་ཚིག་བཞི་པའི་ཚིགས་སུ་བཅད་པ་ཙམ་ཡང་ཉན་པ་དང་། འཆང་བ་དང་། འདྲི་བ་དང་། འདྲིར་འཇུག་པ་དང་། གཞན་ལ་རྒྱས་པར་བྱེད་ན་
en: [compared to such a person,] someone who listens to just one four-line stanza drawn from the various teachings of the Dharma, keeps it in mind, copies it or commissions it to be copied, and promulgates it to others [will have a vastly greater increase in merit.]”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དོན་འདི་ཉིད་རྒྱ་ཆེར་བརྗོད་པར་བྱ་བའི་ཕྱིར་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསུངས་སོ། །
en: When the Blessed One had explained in detail the significance of the various teachings of the Dharma, he then spoke the following verses:

source: ཞིང་སྟོང་བྱེ་བ་གཞན་དུ་གནས་པ་ཡི། །སངས་རྒྱས་མཁས་པ་མཐའ་ཡས་བྱེ་བ་དག །སེམས་ཅན་རྣམས་ཀྱི་ཕྱིར་ནི་དགོངས་མཛད་ཅིང་། །ངན་འགྲོ་ལས་ནི་སེམས་ཅན་ཐར་བར་མཛད། །
en: “Abiding in one trillion other fields, Ten million skillful buddhas Care for beings And liberate them from negative forms of existence.

source: བསྟིར་མེད་ལས་ལ་གནས་ཤིང་སྦྱིན་བྱེད་དག །
en: “After you have performed actions of generosity

source: ལས་བྱས་ནས་ནི་ངན་འགྲོར་སོང་བ་རྣམས། །དེ་དག་ཐར་བར་བྱ་ཕྱིར་ཆོས་འདོད་པས། །དེ་བཞིན་གཤེགས་པ་འདི་དག་མཆོད་པར་བགྱི། །
en: By engaging in ceaseless activity, You should worship the tathāgatas by longing for the Dharma In order to liberate those who have gone to negative forms of existence.

source: རི་མོར་མཆོད་རྟེན་རྣམ་པ་སྣ་ཚོགས་བྱོས། །
en: “Produce drawings, stūpas, and various representations;

source: གསེར་དང་དངུལ་དང་དེ་ལྟར་ལུགས་རྣམས་དང་། །འཇིམ་པའི་སྐུ་གཟུགས་དག་ནི་བྱེད་བཅུག་ནས། །
en: Have statues made, Some of gold or silver, some of metal or clay;

source: མཆོད་པ་སྣ་ཚོགས་ཀྱིས་ནི་མཆོད་པར་གྱིས། །
en: And worship them with various offerings.

source: མེ་ཏོག་དང་ནི་ཕྲེང་བ་བྱུག་པ་དང་། །མར་མེ་སིལ་སྙན་དྲི་དང་སྤོས་ཀྱིས་མཆོད། །
en: “Worship the tathāgatas with flowers, garlands, salves, Lamps, cymbals, perfume, and incense.

source: ཤེས་རབ་ཆེ་བས་བསྔོ་བ་དག་ཀྱང་གྱིས། །
en: With superior insight, dedicate merit as well.

source: མདོ་སྡེ་བཤད་ཅིང་འདིར་ཡང་བཞུགས་པར་གྱིས། །
en: Explain the teachings of the sūtras, and abide by them.

source: དེ་བཞིན་གཤེགས་དང་མདོ་སྡེའི་གཟི་བརྗིད་ཀྱིས། །སྡིག་པའི་ལས་ལས་སེམས་ཅན་དེ་ཐར་གྱིས། །
en: “The majesty of the Tathāgata and of the collection of sūtras Will liberate beings from negative actions.

source: བླ་མེད་བྱང་ཆུབ་རེག་པར་འགྱུར་བར་དུ། །དག་པའི་གནས་སུ་སྐྱེ་བ་འཛིན་པར་འགྱུར། །
en: They will take rebirth in pure abodes Until they reach unsurpassable awakening.

source: སྔོན་གྱི་ལས་རྣམས་རྗེས་སུ་དྲན་འགྱུར་ཞིང་། །དྲན་ནས་མཁས་པ་སྡིག་པ་བྱེད་མི་འགྱུར། །
en: “They will remember their former actions, and having done so, Those who understand will not commit negative actions again.

source: མི་ཡི་བྱང་ཆུབ་སེམས་དཔས་མདོ་སྡེ་འདི། །བཤད་པ་དེས་ནི་བསོད་ནམས་མང་དུ་ཐོབ། །
en: By expounding the bodhisattvas’ collection of sūtras for the sake of humans, They will obtain great merit.

source: དེ་ནི་ལྷ་རྣམས་ཀུན་གྱིས་བསྲུང་བར་འགྱུར། །
en: “They will be protected by the gods.

source: དེ་ཡི་ལུས་འདི་ལ་ནི་ནད་མི་འབྱུང་། །
en: In their bodies no disease will occur.

source: དེ་ཡི་རྒྱལ་སྲིད་ཀུན་ལ་གནོད་མི་འབྱུང་། །
en: Nowhere in their kingdoms will there be strife,

source: ཁྱིམ་དང་གྲོང་དང་གྲོང་ཁྱེར་ཞི་བར་འགྱུར། །
en: And in their homes, villages, and cities there will be peace.

source: གང་ཞིག་མདོ་སྡེ་འདི་ནི་རྟག་འཛིན་པ། །སངས་རྒྱས་རྣམས་ཀྱི་མཛོད་ནི་རྟག་འཛིན་འགྱུར། །
en: “Whoever holds at all times this collection of sutrās Holds at all times the treasury of the buddhas.

source: གང་ཞིག་མཆོད་ཅིང་རྗེད་དང་འདྲིར་འཇུག་དང་། །ལས་གཞན་མེད་པར་ཉན་དུ་འཇུག་པ་ནི། །དེས་ནི་སངས་རྒྱས་ཡང་དག་མཆོད་པར་འགྱུར། །
en: Whoever worships and venerates it, has it copied, and makes it heard, They, without doing anything else, Will perfectly worship the Buddha,

source: དེས་ནི་མྱུར་དུ་བྱང་ཆུབ་མཆོག་རྟོགས་འགྱུར། །
en: And will quickly attain supreme awakening.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལྟད་མོ་ཅན་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: The eager bodhisattva mahāsattva asked the Blessed One,

source: བཅོམ་ལྡན་འདས་བདག་ནི་འདི་ལ་ཐེ་ཙོམ་སྐྱེས་ཏེ།
en: “Blessed One, I have some qualms about this.

source: བཅོམ་ལྡན་འདས་ཅི་ལུས་འདིས་རྒྱལ་སྲིད་ཀྱི་ལོངས་སྤྱོད་བསྒྲུབས་ནས་
en: Having come into possession of a kingdom with this body,

source: སླར་ཡང་སྡུག་བསྔལ་བསྒྲུབ་པར་འགྱུར་རམ།
en: will one again experience suffering?

source: འཁོར་བར་འཁོར་བའི་ཚེ་སྐྱོ་བར་མི་འགྱུར་རམ།
en: Or will there not be any sorrow when one circles in saṃsāra?

source: སྐྱེ་བ་དང་། རྒ་བ་དང་། ན་བ་དང་། འཆི་བ་དང་། མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་རྣམས་མྱོང་བར་འགྱུར་ཞིང་
en: Or alternatively, as one will experience again birth, old age, sickness, death, misery, despair, lamentation, suffering, and unhappiness,

source: ཇི་ལྟར་སྐྱེ།
en: how will one be born, [die, live, and gain happiness]?

source: ཇི་ལྟར་འགུམ།
en: how will one [be born,] die, [live, and gain happiness]?

source: ཇི་ལྟར་འཚོ།
en: how will one [be born, die,] live, [and gain happiness]?

source: ཇི་ལྟར་བདེ་བ་སྒྲུབ་པར་འགྱུར།
en: how will one [be born, die, live, and] gain happiness?

source: ཇི་ལྟར་སྡུག་བསྔལ་མྱོང་བར་འགྱུར།
en: How will one experience suffering?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལྟད་མོ་ཅན་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One answered the eager bodhisattva mahāsattva,

source: ལྟད་མོ་ཅན་འདི་ནི་ལས་ཀྱི་རྐྱེན་ཡིན་པར་བལྟ་བར་བྱའོ། །
en: “You who are eager, you should consider that these experiences are conditioned by karma.

source: རིགས་ཀྱི་བུ་ཡང་འདི་ལ་གང་ཡང་སྐྱེ་བ་མེད། འཆི་བ་མེད། འཚོ་བ་མེད་དེ།
en: Now, son of noble family, there is no birth, no death, no life in this world.

source: རིགས་ཀྱི་བུ་འདི་ལ་རྒ་བ་དང་། འཆི་བ་མེད་ཀྱི། འཚོ་བའི་ཁམས་ནི་རྟག་ཏུ་ལུས་ཀྱི་རྣམ་པར་ཤེས་པ་ལ་གནས་སོ། །
en: Son of noble family, although there is no old age and death here, one’s state of life is always dependent on the body consciousness.

source: ཡང་ལས་ཀྱི་རྐྱེན་དང་ལས་ཀྱི་གཞིས་སྐྱེ་བ་སྣ་ཚོགས་སུ་འོངས་ཤིང་འཕོས་ནས་བདེ་བ་དང་། སྡུག་བསྔལ་མྱོང་བར་འགྱུར་ཏེ།
en: Furthermore, when one transmigrates to various births due to karmic conditions and karmic circumstances, one will experience happiness and suffering.

source: བདེ་བ་ལ་བདེ་བར་འདུ་ཤེས། སྡུག་བསྔལ་ལ་སྡུག་བསྔལ་དུ་འདུ་ཤེས། བདེ་བ་ཡང་མ་ཡིན།
en: One has the notion of happiness as happiness and suffering as suffering.

source: སྡུག་བསྔལ་བ་ཡང་མ་ཡིན་པ་ལ་བདེ་བ་ཡང་མ་ཡིན།
en: One gives rise to the notion that non-happiness is not happiness and that non-suffering is not suffering.

source: སྡུག་བསྔལ་བ་ཡང་མ་ཡིན་པའི་འདུ་ཤེས་སྐྱེད་མོད་ཀྱི། ལྷག་མ་མ་ལུས་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བའི་ཆོས་ཅན་དུ་གྱུར་གྱི་བར་དུ་སྐྱོ་བའི་སེམས་སྐྱེད་པར་འགྱུར་རོ། །
en: Nonetheless, until one possesses the qualities of nirvāṇa in the realm of nirvāṇa without remainder, one will still be subject to sorrow.

source: དཔེར་ན་སྐྱེས་བུ་ལ་ལ་ཞིག་གོས་སར་པ་གྱོན་ཏེ།
en: As an analogy, consider someone who puts on new clothes.

source: དེ་ལ་དེ་གྱོན་ནས་ལས་ཐམས་ཅད་བྱེད་ཅིང་བདེ་བ་དང་སྡུག་བསྔལ་ཡང་མྱོང་བར་འགྱུར་རོ། །
en: Having put them on, this person performs all sorts of actions and experiences happiness and suffering.

source: ཡང་དུས་གཞན་ཞིག་ན་གོས་དེ་རྙིངས་ཤིང་མུགས་ཏེ་དྲི་མ་ཅན་མཐར་བཤད་པར་གྱུར་པ་དང་། དེས་དེ་བོར་བའི་ཆོས་ཅན་དུ་ཤེས་ནས་བོར་རོ། །
en: Later, at another time, this person is finally told that these clothes, being old and moth-eaten, are dirty, upon which he realizes that they should be thrown away, and thus he gets rid of them.

source: བོར་ནས་ཡང་གོས་སར་པ་གསར་མ་གཞན་ཞིག་བཙལ་ཏེ་གྱོན་ནོ། །
en: Once he is rid of them, he again looks for brand new clothes to wear.

source: དེས་གྱོན་ན་ཡང་ལས་བྱེད་ཅིང་བདེ་བ་དང་སྡུག་བསྔལ་མྱོང་བར་འགྱུར་ནས་
en: When he has put them on, he performs various actions and experiences happiness and suffering.

source: དོན་དམ་པའི་གོས་སྲ་ཞིང་བརྟན་ལ་མི་ཤིགས་ཤིང་མི་ཆོད་པ་གྱོན་པར་མ་གྱུར་བར་དུ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་འདི་ལྟ་བུས་བསྐལ་པ་དུ་མ་འདས་ཀྱང་གོས་དེ་བགོས་སོ་ཤེའམ། བོར་རོ། །
en: Until this person has put on genuine clothes that are durable and everlasting, indestructible and unbreakable, then though many eons pass, one after another, he will either have to wear such temporary clothes or throw them away.

source: ཞེས་མི་རྟོག་རྣམ་པར་མི་རྟོག་གིས་དེ་ནི་ལུས་ཀྱི་དབང་དུ་འགྲོའོ། །
en: He does not think about this nor reflect upon it; he is under the influence of the body.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་གང་གི་ཚེ་འཚོ་བའི་ཁམས་དེས་ལུས་འཇིག་པ་དང་། འགྱེལ་བའི་མཐར་གྱུར་པ་མཐོང་བ་དེའི་ཚེ་ལུས་དེ་བོར་ནས་
en: Likewise, son of noble family, at a certain time, due to one’s state of life, one’s body perishes and is seen to be on the point of collapse. At that time, one discards this body and

source: ཡང་སར་པ་གཞོན་ནུ་གཞན་བཙལ་ཏེ།
en: looks for another that is new and young.

source: དེ་དེའི་ལས་བྱེད་ཅིང་དེ་བགོས་ནས་བདེ་བ་དང་སྡུག་བསྔལ་མྱོང་བར་འགྱུར་རོ། །
en: Taking it on and performing actions with it, one will experience happiness and suffering.

source: ཇི་ལྟར་རང་གི་བསོད་ནམས་ལས་སྐྱེས་པའི་གོས་དེ་འཇམ་པ་དང་། སྲ་བ་དང་། རྩུབ་པའི་བགོ་བ་དེ་བཞིན་དུ་འཚོ་བའི་ཁམས་ཀྱིས་བགོ་བ་ལྟ་བུའི་ལུས་བླངས་ཏེ
en: Just as clothes arisen from one’s own merit are soft, hard, or rough, so too one adopts the body that one takes on according to one’s state of life.

source: ཇི་ལྟར་རང་གི་ལས་ཀྱི་རྐྱེན་གྱི་དགེ་བའི་རྩ་བ་ལས་སྐྱེས་པ་བཞིན་དུ་ལྷ་དང་། རྒྱལ་པོ་དང་། སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་རྣམས་སུ་སྐྱེ་བར་འགྱུར་ཏེ
en: Just as one is born according to one’s roots of virtue—namely, one’s karmic conditions—one will be born as a god, a king, a hell being, an animal, or a being from the world of Yama.

source: ལུས་དེ་ཡང་འཚོ་བའི་ཁམས་ཀྱི་དབང་གིས་འགྲོ་ཞིང་འཚོ་བའི་ཁམས་ཀྱིས་ཡོངས་སུ་བཏང་ཡང་མི་རྟོག །
en: Although this body is also influenced by one’s state of life and is given up according to one’s state of life, one does not think about this,

source: རྣམ་པར་མི་རྟོག་གོ། །
en: nor reflect upon it.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་ལུས་གོས་ལྟ་བུར་བལྟ་བར་བྱའོ། །
en: Son of noble family, you should look upon the body just as you look upon these clothes.

source: དཔེར་ན་སྦྲུལ་ནི་ལས་ཀྱི་རྐྱེན་གྱིས་དུས་ཀྱི་མཐར་ཤུན་པ་དེ་བོར་ནས་རང་གི་ལུས་ཀྱི་གཟུགས་ཀྱིས་འགྲོ་ཞིང་འོང་སྟེ།
en: a snake that, when the time has come on account of karmic conditions, sheds its skin, and then comes and goes in keeping with its physical shape.

source: བདེ་བ་དང་སྡུག་བསྔལ་མྱོང་བར་གྱུར་ཀྱང་ཤུན་པ་དེ་མི་རྟོག །
en: Although the snake will experience happiness and suffering, it does not think about its skin

source: དེ་བཞིན་དུ་འཚོ་བའི་ཁམས་ནི་སྦྲུལ་ལྟ་བུར་བལྟའོ། །
en: You should look upon your state of life just as you look upon this snake.

source: དཔེར་ན་ཤིང་ལོ་མ་དང་འདབ་མར་ལྡན་པར་གྱུར་པ་ལས། ཡང་དུས་ཀྱི་རྐྱེན་གྱིས་འཇིག་པ་དང་ལྟུང་བར་མཐར་འགྱུར་བའི་ཆོས་ཅན་དུ་གྱུར་ནས་
en: a tree that, after it has developed its leaves and foliage, will then, with time, evolve so that finally they wither and fall.

source: ཕྱིས་ཡང་དུས་ཀྱི་རྐྱེན་གྱིས་མྱུ་གུ་དང་། ཡལ་ག་དང་། འདབ་མ་དང་། མེ་ཏོག་དང་། འབྲས་བུ་རྣམས་ལེན་ཏེ
en: And then yet later again, with time, it will grow buds, branches, foliage, flowers, and fruit.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་ལས་ཀྱི་རྐྱེན་གྱིས་སྐྱེ་བ་དང་འགག་པར་བལྟའོ། །
en: Son of noble family, it is in this way that you should look upon arising and cessation due to karmic conditions.

source: རིགས་ཀྱི་བུ་ཡང་ཕྱི་མའི་དུས་ཕྱི་མའི་དུས་ཀྱི་ཚེ་ན་སེམས་ཅན་དག་རྙེད་པ་དང་། ཆགས་པ་དང་། ཁྲོ་བ་དང་། ཕྲག་དོག་དང་། ང་རྒྱལ་མང་བ་དག་འབྱུང་སྟེ
en: “Now, son of noble family, some time in the future beings will experience more greed, attachment, anger, envy, and pride.

source: སྲང་དང་གཞལ་བ་ལ་གཡོ་བྱེད་པར་དགའ་བ་འདོད་ཆགས་ཀྱི་རྗེས་སུ་སྤྱོད་པ་དག་འབྱུང་སྟེ།
en: As they cause the scales and weights of karma to move, their behavior will follow upon pleasure and attachment, so that

source: དེ་དག་འདོད་པའི་རྒྱུ་དང་འདོད་པའི་གཞིས་སྡིག་པ་མང་དུ་བྱེད་པར་འགྱུར་ཏེ།
en: they will commit more negative actions based upon or caused by their attachment.

source: སྡིག་པ་མང་དུ་བྱས་ནས་
en: Committing more negative actions,

source: སྡུག་བསྔལ་མྱོང་བར་འགྱུར་ཞིང་
en: they will experience suffering.

source: མི་རྟག་པ་ལ་རྟག་པའི་འདུ་ཤེས་ཅན་དང་། མི་གཙང་བ་ལ་གཙང་བའི་འདུ་ཤེས་ཅན་གྱིས་སངས་རྒྱས་དང་ཆོས་དང་དགེ་འདུན་ལ་མཆོད་པ་བྱེད་པར་མི་འགྱུར་ཏེ
en: They who construe impermanent things as permanent and the impure as pure will not venerate the Buddha, the Dharma, and the Saṅgha.

source: བྱིས་པའི་བློ་ཅན་དེ་དག་དགེ་བའི་བཤེས་གཉེན་མི་ཚོལ་གྱི།
en: These infantile people will not seek out a spiritual friend.

source: གང་དེ་ལྟ་བུའི་སེམས་ཅན་དེ་དག་ལ་ཆོས་སྟོན་པ་དེ་དག་ལ་དགོད་ཅིང་ཀྱལ་ཀ་བྱེད་པ་མང་བར་འགྱུར་གྱི།
en: Instead, they will mock and ridicule those who teach them the Dharma, rather than

source: དད་པར་མི་བྱེད། ཡིད་ཆེས་པར་མི་བྱེད་དེ།
en: having faith or trust in them.

source: དེ་ལྟ་བུའི་སེམས་ཅན་དེ་དག་ནི་སྡིག་པ་སྤྱོད་དོ། །
en: Such beings will perform negative actions.

source: དེ་དག་གིས་འཚོ་བའི་ཁམས་དེས་ལས་ཀྱི་རྐྱེན་ཇི་ལྟ་བ་བཞིན་དུ་མྱོང་བར་འགྱུར་བའི་བགོ་བའི་ལུས་བླངས་ནས་
en: They will adopt the body that they take on and which they will experience in keeping with karmic conditions and according to their particular state of life.

source: སྡུག་བསྔལ་ལ་དགའ་བའི་འདུ་ཤེས་སྐྱེད་དོ། །
en: They will then give rise to notions of suffering and pleasure.

source: རིགས་ཀྱི་བུ་དེ་ལྟ་བས་ན་དེ་བཞིན་གཤེགས་པས་བཀའ་སྩལ་པ།
en: “Son of noble family, this is the answer of the Tathāgata.

source: འདི་ནི་ལས་ཀྱི་རྐྱེན་ཡིན་པར་བལྟ་སྟེ།
en: This body should be regarded as karmically conditioned.

source: འདི་ལ་སུ་ཡང་འཆི་བ་མེད།
en: For this body also there is no death,

source: འཚོ་བ་མེད།
en: there is no life;

source: བདེ་བ་དང་། སྡུག་བསྔལ་ཡང་མྱོང་བར་མི་འགྱུར་ཏེ།
en: happiness and suffering will not be experienced but

source: ལས་ཀྱི་རྒྱུ་ལས་ཀྱི་རྐྱེན་གྱིས་སྐྱེ་བ་དང་འགག་པར་འགྱུར་རོ། །
en: they will arise and cease according to karmic causes and conditions.

source: སེམས་ཅན་དེ་དག་གི་དོན་དུ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་དཀའ་བ་སྤྱོད་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་མཛད་ནས་
en: The tathāgatas have undergone sextillions of hardships for the sake of beings.

source: བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་བཏང་ནས་
en: Having completely given up all their possessions,

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་སངས་རྒྱས་པར་འགྱུར་ཏེ
en: they become perfectly awakened within unsurpassable, complete, and perfect awakening, and

source: སེམས་ཅན་ཐམས་ཅད་ཀྱང་མྱ་ངན་ལས་འདས་པ་ཆེན་པོ་ལ་བཀོད་དོ། །
en: establish all beings, too, in great nirvāṇa.”

source: དེ་ནས་དེའི་ཚེ་ན་དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ཀྱིས་ས་ཆེན་གཡོས་པར་གྱུར་ཏོ། །
en: At that point, the Tathāgata’s sovereign power caused the whole earth to tremble.

source: ཇི་ལྟར་ལྷགས་པའི་འཁོར་དེ་དག་གིས་ཀྱང་བཅོམ་ལྡན་འདས་ལ་ལེགས་སོ་ཞེས་གསོལ་ཏོ། །
en: The assembled retinue said to the Tathāgata, “Excellent!”

source: རྒྱལ་པོ་གསལ་རྒྱལ་དང་གཞན་ཡང་མཐུ་ཆེན་པོ་མཐུ་ཆེ་བ་རྫུ་འཕྲུལ་ཆེན་པོ་མང་པོས་ལྷའི་ན་བཟའ་ལྔ་བརྒྱས་དེ་བཞིན་གཤེགས་པ་ལ་མངོན་པར་མཆོད་ནས་
en: King Prasenajit and the others, by means of many, great, more and more powerful supernatural powers, made an offering to the Tathāgata of five hundred divine garments.

source: ལུས་འདར་བཞིན་དུ་བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ
en: Trembling, they circumambulated the Tathāgata three times.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྤྱན་སྔར་སྡིག་པ་ཐམས་ཅད་ཉེས་པ་ལ་ཉེས་སོ་ཞེས་སོ་སོར་བཤགས་ཏེ་
en: In the presence of all the tathāgatas, each of them confessed that the faults consisting of all their negative actions had indeed been committed, and

source: བསླབ་པ་ལ་ཡི་དམ་བཅའ་བར་བྱ་སྟེ།
en: they promised to adopt the training.

source: ཇི་ལྟར་ལྷགས་པའི་འཁོར་དེ་དག་གིས་འདི་སྐད་དུ་སྨྲས་སོ། །
en: At the same time, the assembled retinue exclaimed,

source: དེ་བཞིན་གཤེགས་པ་སྐྱེ་བ་ཐམས་ཅད་ལས་སླར་ལོག་པ། སེམས་ཅན་ཐམས་ཅད་སྡུག་བསྔལ་ལས་སྒྲོལ་བ། གྲོལ་བ་ཐམས་ཅད་ལ་ཕྱག་བགྱིའོ། །
en: “Tathāgata, we pay homage to those who have turned away from all births, freed all beings from suffering, and attained liberation.

source: ཕྱག་འཚལ་ལོ། །
en: Homage to them!

source: བཅོམ་ལྡན་འདས་སླན་ཆད་བདག་ཅག་སྐྱེ་བའི་འཁོར་བར་སྡུག་བསྔལ་མྱོང་བར་སྤྲོ་བར་མི་བགྱིད་དོ། །
en: Blessed One, in the future, we will not take any delight in the experiences of suffering in saṃsāra.

source: བཅོམ་ལྡན་འདས་བདག་ཅག་སྐྱེ་བ་དང་། རྒ་བ་དང་། ན་བ་དང་། འཆི་བ་དང་། མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་རྣམས་ལས་གྲོལ་བར་མཛད་དུ་གསོལ།
en: Blessed One, we pray that you liberate us from birth, old age, disease, death, misery, despair, lamentation, suffering, unhappiness, and distress.”

source: རིགས་ཀྱི་བུ་དག་ནན་ཏན་སྙིང་པོར་བྱེད་པའི་དགེ་བའི་རྩ་བས་དཀོན་མཆོག་གསུམ་ལ་ལྷག་པའི་བསམ་པ་དང་ལྡན་པར་བྱོས་ཤིག །
en: “Sons of noble family, with roots of virtue that focus upon diligent application, may you acquire the superior intention directed at the Three Jewels.

source: འདུ་བྱེད་ཐམས་ཅད་མི་རྟག་ཅིང་སྒྱུ་མ་ལྟ་བུར་ཤེས་པར་བྱོས་ཤིག །
en: Know all conditioned phenomena to be impermanent and like illusions.

source: དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བ་ལ་སྤྲོ་བར་བྱོས་ཤིག །
en: Be filled with joy at upholding the holy Dharma.

source: མཆོད་པ་དང་། རྗེད་པ་དང་། བཀུར་སྟི་མང་བར་བྱོས་ཤིག །
en: May you worship, revere, and venerate it more and more.

source: སེམས་ཅན་ཐམས་ཅད་ལ་མཆོག་ཏུ་སྙིང་རྗེ་བར་ཤེས་པར་བྱོས་ཤིག །
en: Know it as supreme compassion for all beings.

source: ཆོས་སྨྲ་བ་ལ་དེ་བཞིན་གཤེགས་པའི་འདུ་ཤེས་བསྐྱེད་པར་བྱོས་ཤིག །
en: Consider the one who expounds the Dharma as a tathāgata.

source: དགེ་བའི་བཤེས་གཉེན་ལ་བླ་མར་འདུ་ཤེས་བསྐྱེད་པར་བྱོས་ཤིག །
en: Consider virtuous friends as gurus.

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཡིད་ལ་བྱ་བ་དང་། སྒོམ་པ་དང་། རྒྱས་པར་བྱོས་ཤིག །
en: Keep in mind, cultivate, and spread the various Dharma discourses.

source: རིགས་ཀྱི་བུ་སྡུག་བསྔལ་ཐམས་ཅད་དང་། སྐྱེ་བ་ཐམས་ཅད་དང་། རྒ་བ་དང་། ན་བ་དང་། འཆི་བ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་ཆེན་པོ་ལས་ཡོངས་སུ་གྲོལ་བར་འགྱུར།
en: Sons of noble family, you will be liberated from all sufferings, all births, old age, disease, death, misery, unhappiness, and great distress.

source: འཁོར་བའི་ཞགས་པ་ལས་ཡོངས་སུ་གྲོལ་བར་འགྱུར་རོ། །
en: You will be liberated from the noose of saṃsāra.

source: འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་དགེ་བའི་རྩ་བ་ལ་བསྒྲུབ་པར་བྱོས་ཤིག །
en: Practice the roots of virtue, that is, the noble eightfold path.

source: བག་མེད་པའི་གནས་ལས་སླར་ལྡོག་པར་བྱོས་ཤིག །
en: May you turn away from the state of not being vigilant.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པའི་བསླབ་པ་ཅིག་ཡུད་ཙམ་པ་བཟུང་བས་ཀྱང་སེམས་ཅན་རྣམས་སྡུག་བསྔལ་ཐམས་ཅད་ལས་ཡོངས་སུ་གྲོལ་ཞིང་བདེ་འགྲོར་འགྲོ་སྟེ་
en: “Sons of noble family, once beings adopt even a single training of the Tathāgata for only a short while, they will be liberated from all suffering, experience pleasant rebirths, and

source: ངན་འགྲོར་མི་འགྲོ་བར་འགྱུར་ན
en: will not experience negative forms of existence.

source: གང་དག་དགོད་པ་དང་། ཀུ་རེ་དང་། དགའ་བ་དང་། རྩེད་མོ་རྣམས་ཡིད་ཀྱིས་ཡོངས་སུ་སྤངས་ནས་
en: That being so, what need is there to mention those who, after abandoning jokes, amusement, pleasure, and games,

source: དེ་བཞིན་གཤེགས་པ་ལ་མཆོག་ཏུ་མོས་པས་རིམ་གྲོ་བྱེད་ཅིང་ལྷག་པའི་བསམ་པས་བཞུགས་ཏེ
en: through their sublime devotion to the Tathāgata perform rituals to him, live with superior intentions, and

source: འཕགས་པའི་ཉེ་བར་གནས་པ་ཡན་ལག་བརྒྱད་པ་ལ་ཉེ་བར་གནས་ནས་གསོ་སྦྱིན་ཡང་དག་པར་བླངས་ཏེ།
en: practice the restoration and purification of their vows with the eight-branched fasting ritual?

source: སྤྱོད་པ་དེ་དག་ངན་སོང་གསུམ་དུ་མི་སྐྱེ་ཞིང་། བདེ་འགྲོར་འགྲོ་བར་འགྱུར་བ་དང་། ལྷ་དང་མིའི་བདེ་བ་མྱོང་ནས་སྡུག་བསྔལ་མཐར་བྱས་ཏེ།
en: all those who practice these sorts of conduct will not be born in the three negative forms of existence, but will pass to pleasant ones, and that, having experienced the happiness of gods and humans, their suffering will come to an end so that

source: རིམ་གྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་ལྟ་ཅི་སྨོས།
en: What need is there to mention that gradually they will fully and completely awaken to unsurpassable, complete, and perfect awakening?

source: བུད་མེད་ཀྱི་ལུས་ཉོན་མོངས་པ་དང་ཉེ་བའི་ཉོན་མོངས་པས་ཉོན་མོངས་པར་གྱུར་པ་ལ་ལ་ཞིག་ཉིན་གཅིག་གམ་ཉི་མ་ཕྱེད་དམ། ཡུད་ཙམ་ཡང་རུང་སྟེ། གསུམ་ལ་སྐྱབས་སུ་འགྲོ་བ་ཡང་དག་པར་ལེན་ཅིང་བསླབ་པ་འཛིན་པར་བྱེད་ན་
en: “Whoever has the body of a woman tainted by the fundamental and secondary defilements, if they genuinely take refuge in the Three Jewels and adopt the training, whether for one day, half a day, or just a moment,

source: དེ་དག་ཐམས་ཅད་བུད་མེད་ཀྱི་དངོས་པོ་དང་། སྡུག་བསྔལ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་ཐམས་ཅད་རྣམ་པར་བཟློག་སྟེ
en: they will all dispel that condition of being a woman, suffering, unhappiness, and afflictions.

source: སྡུག་བསྔལ་མཐར་བྱས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཀྱི་བར་དུ་བདེ་འགྲོར་འགྲོ་བར་འགྱུར་རོ། །
en: Having put an end to suffering, they will go to pleasant forms of existence until they become fully and perfectly awakened buddhas within unsurpassable, complete, and perfect awakening.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ལུས་དང་། ངག་དང་། ཡིད་ཀྱི་ཡི་དམ་འཆའ་བ་དང་། བསླབ་པ་འཛིན་པ་ཡང་དག་པར་ལེན་པར་བྱེད་པ་ནི་ཡོན་ཏན་དང་དགེ་བའི་རྩ་བ་མང་པོ་དང་ལྡན་པ་ཡིན་ན
en: Sons of noble family, [the infantile do not recognize that] one who genuinely takes up the pledges and the training commitments of body, speech, and mind is endowed with many qualities and great roots of virtue.”

source: བྱིས་པ་དག་གིས་ནི་དེ་མི་ཤེས་སོ། །
en: the infantile do not recognize that

source: དེ་ནས་དེའི་ཚེ་ན་བར་སྣང་ལས་སྒྲ་ཆེན་པོ་བྱུང་བར་གྱུར་པ་དང་། འཁོར་དེ་དག་ཐམས་ཅད་ཀྱིས་ཨེ་མའོ་ཨེ་མའོ་ཞེས་དམ་པའི་སྒྲ་བྱུང་ནས་
en: At that moment, a great noise resounded in the sky. All the retinue marveled,
